<a href="https://colab.research.google.com/github/rjc89/Tutorials/blob/master/makespace_SQL_with_Pi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## SQL relation database model:

RDBMS Relational Database Management Systems:

MySQL, Postgresql (), ORACLE, SQLite (lightweight, Python built in), SQL Alchemy


SQL is declarative

## Never put live code into an SQL db

also security risk if users are able to inject code into it 

SQL injection vulnerabilities

utf8mb4_general_ci 

utf 8

maximum bytes 4

general ? 

case insensitive


utf8mb4_general_ci is a simplified set of sorting rules which aims to do as well as it can while taking many short-cuts designed to improve speed. It does not follow the Unicode rules and will result in undesirable sorting or comparison in some situations, such as when using particular languages or characters.

## Unique keys not just integers

Sharding using uuid - a randomly generated string of letters and numbers

national insurance no

name surname place of birth and some random nos is also unique


â€¢ you can have a surrogate key but the uuid would be the natural key. Surrogate key mandatory in SQL alchemy

In [0]:
ssh u5@10.0.0.246

password: u5
    
u5@mr-pi:~ $ mysql -w u5 -p
Enter password:

In [0]:
# Create tables in MySQL

NAME SURNAME TEL No. AGE

STEVE BURKE  77777 .  77

In [0]:
Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MariaDB [u5]> use sbo
ERROR 1044 (42000): Access denied for user 'u5'@'%' to database 'sbo'
MariaDB [u5]> use test
ERROR 1044 (42000): Access denied for user 'u5'@'%' to database 'test'
MariaDB [u5]> u5 test
    -> create database u5
    -> use u5
    -> 
    -> 
    -> ;
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'u5 test
create database u5
use u5' at line 1
MariaDB [u5]> show tables;
Empty set (0.00 sec)b

#b

CREATE   --> INSERT

RETRIEVE --> SELECT

UPDATE   -->

DELETE   --> Delete or TRUNCATE (nuclear option)

** Adding columns may be a problem with some SQL implementations

In [0]:
u5@mr-pi:~ $ mysql -w u5 -p
Enter password: 
Welcome to the MariaDB monitor.  Commands end with ; or \g.
Your MariaDB connection id is 37
Server version: 10.1.38-MariaDB-0+deb9u1 Raspbian 9.0

Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MariaDB [u5]> use sbo
ERROR 1044 (42000): Access denied for user 'u5'@'%' to database 'sbo'
MariaDB [u5]> use test
ERROR 1044 (42000): Access denied for user 'u5'@'%' to database 'test'
MariaDB [u5]> u5 test
    -> create database u5
    -> use u5
    -> 
    -> 
    -> ;
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'u5 test
create database u5
use u5' at line 1
MariaDB [u5]> show tables;
Empty set (0.00 sec)

MariaDB [u5]> create table addressbook ()
    -> create table addressbook (name varchar(128), surname varchar(128), tel_no varchar(24), age integer);
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near ')
create table addressbook (name varchar(128), surname varchar(128), tel_no varc' at line 1
MariaDB [u5]> create table addressbook () create table addressbook (name varchar(128), surname varchar(128), tel_no varchar(24), age integer);
ERROR 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near ') create table addressbook (name varchar(128), surname varchar(128), tel_no varc' at line 1
MariaDB [u5]> create table addressbook (name varchar(128), surname varchar(128), tel_no varchar(24), age integer);
Query OK, 0 rows affected (0.05 sec)

MariaDB [u5]> show tables;
+--------------+
| Tables_in_u5 |
+--------------+
| addressbook  |
+--------------+
1 row in set (0.00 sec)

MariaDB [u5]> describe addressbook
    -> 
    -> 
    -> ;
+---------+--------------+------+-----+---------+-------+
| Field   | Type         | Null | Key | Default | Extra |
+---------+--------------+------+-----+---------+-------+
| name    | varchar(128) | YES  |     | NULL    |       |
| surname | varchar(128) | YES  |     | NULL    |       |
| tel_no  | varchar(24)  | YES  |     | NULL    |       |
| age     | int(11)      | YES  |     | NULL    |       |
+---------+--------------+------+-----+---------+-------+
4 rows in set (0.01 sec)

MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '0122334', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '0122334', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '0122334', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '0122334', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '01223342', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> select * from addressbook;
Empty set (0.00 sec)

MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' '01223342', 23);
ERROR 1136 (21S01): Column count doesn't match value count at row 1
MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' ,'01223342', 23);
Query OK, 1 row affected (0.01 sec)

MariaDB [u5]> select * from addressbook;
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
1 row in set (0.00 sec)

MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' ,'01223342', 23);
Query OK, 1 row affected (0.02 sec)

MariaDB [u5]> select * from addressbook;
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
2 rows in set (0.00 sec)

MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' ,'01223342', 23);
Query OK, 1 row affected (0.01 sec)

MariaDB [u5]> insert into addressbook values ('Mark', 'Foo' ,'01223342', 23);
Query OK, 1 row affected (0.01 sec)

MariaDB [u5]> select * from addressbook;
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
4 rows in set (0.00 sec)

MariaDB [u5]> select name, surname from addressbook;
+------+---------+
| name | surname |
+------+---------+
| Mark | Foo     |
| Mark | Foo     |
| Mark | Foo     |
| Mark | Foo     |
+------+---------+
4 rows in set (0.00 sec)

MariaDB [u5]> select * from addressbook where age > 20;
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
4 rows in set (0.00 sec)

MariaDB [u5]> select * from addressbook where age > 20 and name = "Mark";
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
4 rows in set (0.00 sec)

MariaDB [u5]> insert into addressbook values ('kevin', 'smith' ,'01243342', 35);
Query OK, 1 row affected (0.01 sec)

MariaDB [u5]> select * from addressbook where age > 20 and name = "Mark";
+------+---------+----------+------+
| name | surname | tel_no   | age  |
+------+---------+----------+------+
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
| Mark | Foo     | 01223342 |   23 |
+------+---------+----------+------+
4 rows in set (0.00 sec)

MariaDB [u5]> select * from addressbook where age > 20 and name = "kevin";
+-------+---------+----------+------+
| name  | surname | tel_no   | age  |
+-------+---------+----------+------+
| kevin | smith   | 01243342 |   35 |
+-------+---------+----------+------+
1 row in set (0.00 sec)

MariaDB [u5]> select * from addressbook where age > 20 and name = "kevin";